# DefineCustomObj

## Description
Calls GS_DefineCustomObject for a passed plugin name and preference.

```pascal
FUNCTION DefineCustomObj(
				pluginName : STRING;
				prefWhen   : INTEGER) : HANDLE;
```

```python

def vs.DefineCustomObj(pluginName, prefWhen):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pluginName|STRING||
|prefWhen|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* Objects - Custom